<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title></title>
</head>
<style>
h1{text-align:center;border-bottom: 3px solid black;border-radius: 0em 0em 8em 8em;width:40%;margin-left:30%;margin-right:30%;box-shadow: 5px 0px 5px lightGrey;}
h2{border-bottom: 3px solid black;border-radius: 0em 0em 0.1em 0.1em;box-shadow: 5px 0px 5px lightGrey;width:58.5vw;text-align:center;}
table{width:96.5%;box-shadow: 5px 0px 5px lightGrey;font-size: 2vh}
legend{width:35%;border:1px solid black;border-radius: 1em 1em 0em 0em;padding-left: 20px;font-size: 3vh;}
fieldset{border-radius:1%; padding: 5px;box-shadow: 5px 0px 5px lightGrey;margin:5px}
p{}
</style>
<body>
 <h1>Что такое общество?</h1>
 <h2>Варианты ответа</h2>
 <section style="display:flex; flex-flow:row wrap;justify-content:space-between">
  <aside style="flex-grow:1;margin:0px">
   <table border="1">
    <tr>
     <th></th>
     <th>Соотношение объективных и субъективных факторов общественного развития</tn>
     <th>Соотношение материальных и духовных сфер жизни общества</tn>
     <th>Направ­ленность исторического развития. Понятие «прогресс»</th>
     <th>Достоинства</tn>
     <th>Недостатки</tn>
    </tr>
    <tr>
     <td style="border-bottom:3px solid black">Цивилизационный подход</td>
     <td style="border-bottom:3px solid black">Человек — единст­венный творец истории, стоит в центре прошлого и настояще­го. Общественно-исто­рическое познание — это познание человека через формы и продук­ты его трудовой, соци­альной, политической и другой деятельности</td>
     <td style="border-bottom:3px solid black">Ценностные установки, мировоззрение играют в развитии общества не меньшую роль, чем материальные факторы, а в ряде случаев могут стать определяющими</td>
     <td style="border-bottom:3px solid black">Каждая цивилизация неповторима, каждая вносит свой оттенок в «палитру» человеческого многообразия. Прогресс относителен, он может охватывать отдельные сферы жизни общества: экономику, технологии. Применительно к духовной культуре это понятие можно использовать очень ограниченно</td>
     <td style="border-bottom:3px solid black">Позволяет глубоко изучить историю конкретных обществ и народов во всем их многообразии и специфике;ориентирует на изучение тех сторон общественной жизни, которые обычно выпадают из поля зрения сторонников формационного подхода (ценности, национальные особенности, духовная жизнь, психология и др.)</td>
     <td style="border-bottom:3px solid black">- сводит к минимуму возможности исследования закономерностей исторического развития человеческого общества/;</td>
    </tr>
    <tr>
     <th style="border-top:3px solid black">Формационный подход</tn>
     <th style="border-top:3px solid black">Объективные закономерности развития носят всеобщий характер. Хотя общественные законы прокладывают себе путь через деятельность людей, они непреложны</tn>
     <th style="border-top:3px solid black">Материальные факторы (прежде всего произ­водство) играют решающую роль в развитии общества</tn>
     <td style="border-bottom:3px solid black">Общество движется от бо­лее низкой к более высокой ступени развития. Главные критерии про­гресса связаны с совершенствованием производ­ственных отношений</td>
     <td style="border-bottom:3px solid black">Позволяет:
- увидеть то общее, что было в историческом раз­витии различных народов;
- представить историю человеческого общества как единый процесс; 
— установить определен­ные закономерности ис­торического развития об­щества;
- предложить опреде­ленную периодизацию всемирной истории и ис­тории отдельных стран
- Нет уникальность</td>
     <td style="border-bottom:3px solid black"></td>
    </tr>
    <tr>
     <td></td>
     <td></td>
     <td></td>
    </tr>
   </table>
   <fieldset style="width:95%;display:flex; flex-flow:row wrap">
    <legend>Timeline</legend>
    <canvas id="st" width="100%" height="40%" tabindex="1" style="border:1px solid dimgray;border-radius:5%;padding:5px;margin:5px"></canvas>
    <fieldset style="box-shadow: 0px 0px 0px white;margin-top:5px;flex-grow:1;width:70%">
     <h3>Конспект учебника/начало</h3>
     <h4>Определение общества</h4>
     <p>Под обществом мы понимаем определённую группу людей, объединившихся для общения совместной деятельности взаимопомощи и поддержки друг друга</p>
     <p>Определённый этап исторического развития человечества или конкретная страна</p>
     <P>Общество - это обособившаяся от природы, но тесно связанная часть мира, которая включает в себя способы взаимодействия людей и формы их объединения</P>
     <P>Индивидов иногда называют "социальными атомами"</P>
     <p>В процессе совместной деятельности возникает взаимодействие между её участниками</p>
     <p>Отметим, что животные к окружающей среде приспосабливаются</p>
     <p>Деятельность человека носит практически преобразовательный характер. Человек не ограничивается приспособлением к существующим природным и социальным условиям.</p>
     <p>В процессе своей жизнедеятельности человек преобразует окружающую среду. Для этого используются не только природные предметы, но и созданные самим человеком</p>
     <p>В основе поведения животного - биологическая программа поведение и инстинкты. Человеческая деятельность характеризуется исторически сложившимися программами</p>
     <p>Целеполагание присущие только человеческой деятельности</p>
     <p>Важным условием жизни для человека является коллектив - человек существо общественное. Жизнь обеспечивается кооперацией</p>
     <p>Выживание человека в отрыве от общества возможно лишь при использовании предметов, созданных в ходе совместной деятельности людей, или по крайней мере знаний и опыта, полученных в обществе</p>
     <p>Общество может быть понято как - совокупность различных форм объединения людей для деятельности</p>
     <p>Одни исследователи рассматривают общества на уровне действующих в нём организаций, другие сквозь призму взаимодействия социальных общностей</p>
     <p>Многообразные связи, возникающие между социальными группами, а также внутри их, в процессе экономической социальной политической культурной жизнедеятельности называется общественными отношениями</p>
     <p>Возникающие в ситуациях эпизодичных контакты не относятся к общественным отношениям</p>
     <p>Само понятие культура в наиболее широком смысле означает всё созданное человеком</p>
     <p>Возделывание, воспитание, образование - культура</p>
     <p>Таким образом мир культуры - это и материальные, и духовные результаты деятельности человека</p>
     <p>Даже естественное проявление нашей жизни преображается под влиянием культуры(потребление пищи)</p>
     <p>Общепринятым делением культуры является: материальная( здание, транспортное средство) и духовные (знания, язык, символы и так далее).</p><p>Исследователи, изучавшие культуры различных народов пришли к выводу, что всем культурам присущи некоторые общие черты или формы, культурные универсалы</p>
     <p>Общество это нечто иное, как совокупность людей, наделенных волей и сознанием, совершающих действия и поступки под влиянием определённых интересов, мотивов, настроение</p>
     <p>Некоторые философы исходят из того, что социальные явления подчиняються законам общим для всех действительности, и можно использовать методы социального исследования. В рамках другого философского течения принята попытка устранить противостояния объективных явлений и познания, признающее человека переживающим </p>
     <h4>Признаки общества</h4>
     <li>Самостоятельная система</li>
     <li>Имеет свою территорию</li>
     <li>Есть своя история и культура</li>
    </fieldset>
   </fieldset>
  </aside>
  <fieldset style="flex-grow:2;width:80%;padding:0px;margin:0px">
   <h3>Конспект учебника/продолжение</h3>
  </fieldset>
 </section>
 <script>
        window.onload = init;
        var canvas,ctx;
         function init(){
          canvas = document.getElementById("st");
          ctx = canvas.getContext('2d');
          var w = window.innerWidth;
          var h = window.innerHeight;
          canvas.height = h+500;
          canvas.width = w-1550;
          resizeCanvas();
         }
          window.addEventListener('resize', resizeCanvas, false);
           function resizeCanvas() {
            var w = window.innerWidth;
            var h = window.innerHeight;
            window.ratiow = 22/window.innerWidth;
            window.fontSize = window.innerWidth * window.ratiow;
            canvas.height = h+500;
            canvas.width = w-1550;
            drawline(30,95);
            drawline(30,175);
            drawline(30,250);
            drawline(30,320);
            drawline(30,390);
            drawline(30,460);
            drawline(30,530);
            drawperiod(30,560,"......",".....","....");
            drawperiod(30,490,".....","....","....");
            drawperiod(30,420,"......","....","....");
            drawperiod(30,45,"Первобытно общинное","......",".....");
            drawperiod(30,120,"Рабовладельческое","....","....");
            drawperiod(30,200,"Феодальное",".....","....");
            drawperiod(30,280,"Капиталистическое","....."," .... ");
            drawperiod(30,350,"(планируется коммунистическое)","....."," .... ");
            drawperiod(0,700,"......",".....","......");
            drawperiod(0,800,".......","......",".......");
            drawperiod(0,900,"......",".......","......");
            drawArrow();
            }
         function drawArrow(){
           ctx.save();
           ctx.moveTo(30,45);
           ctx.lineTo(30,640);
           ctx.lineTo(15,610);
           ctx.arcTo(30,615,35,610,21);
           ctx.lineTo(30,642)
           ctx.fillStyle="black";
           ctx.fill();
           ctx.lineWidth = 6;
           ctx.stroke();
           ctx.restore();
          }
        function drawperiod(x1,y1,text1,text2,text3){
          ctx.save();
          ctx.font = (window.fontSize|0) + "px serif";
          ctx.fillText(text1,x1+15,y1);
          ctx.fillText(text2,x1+15,y1+20);
          ctx.fillText(text3,x1+15,y1+40);
          ctx.fillStyle='white';
          ctx.lineWidth = 1;
          ctx.strokeStyle = "black";
          ctx.moveTo(x1,y1);
          ctx.arc(x1,y1,8,0,2*Math.PI);
          ctx.stroke();
          ctx.fill();
          ctx.restore();
        }
        function drawline(x1,y1){
          ctx.save();
          ctx.lineWidth = 1;
          ctx.strokeStyle = "black";
          ctx.moveTo(x1,y1);
          ctx.lineTo(x1 + 200,y1)
          ctx.stroke();
          ctx.restore();
        }
       </script>
</body>

</html>
